//******************************************************************************
// マップ[map.h]
// Author : 管原司
//******************************************************************************
#ifndef _MAP_H_
#define _MAP_H_
//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "scene.h"
//******************************************************************************
// 前方宣言
//******************************************************************************

//******************************************************************************
// クラス
//******************************************************************************
class CMap : public CScene
{
public:
	// 種類
	typedef enum
	{
		TYPE_NONE = -1,	// 最小
		TYPE_FLOOR,		// 床ブロック
		TYPE_MAX		// 最大
	}TYPE;

	CMap(int nPriority = OBJTYPE_FLOOR);
	~CMap();
	static CMap *Create(void);
	void MapLoad(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void SetRowCol(void);	// 行と列設定
	TYPE **m_apMapIndex;	// 行列
	int m_nRow;				// 行
	int m_nCol;				// 列
};
#endif